app/Controllers/Home.php

    public function index(): string
    {
        $category = new PetModel();
        $category = $category->where('status',1)->find();

        $products = new PetProductsModel();
        $products = $products->where('status',1)->orderBy('created_at','DESC')->limit(6)->find();
---
SELECT *
FROM `pets`
WHERE `status` = 1
SELECT *
FROM `pet_products`
WHERE `status` = 1
ORDER BY `created_at` DESC
 LIMIT 6

    public function productdetail($prod_id){
        $prodouct_details = new PetProductsModel();
        $prodouct_details = $prodouct_details->where(['id'=>$prod_id,'status'=>1])->first();
---
SELECT *
FROM `pet_products`
WHERE `id` = '7'
AND `status` = 1
 LIMIT 1