app/Controllers/Users.php

SELECT *
FROM `my_order`
WHERE `user_id` = '3'
SELECT *
FROM `pet_products`
WHERE `id` IN ('7','6')
---
    public function myorder(){
        if($this->curr_user->type == 1){
            $myorder = new MyOrderModel();
            $myorder_list= $myorder->where('user_id',$this->curr_user->id)->find();
            $product = new PetProductsModel();
            foreach($myorder_list as &$mol){
                $products = $product->whereIn('id',explode(',',$mol['product_ids']))->find();