app/Controllers/Users.php

    public function profile(){
        $user = new UserModel();
        $user = $user->where('id',$this->curr_user->id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '3'
 LIMIT 1

    public function mycart(){
        $user_id = $this->curr_user->id;
        $cart = new CartModel();
        $cart_lists = $cart->where('user_id',$user_id)->find();
        $list_array = array();
        $produt = new PetProductsModel();
        foreach($cart_lists as $cl){
            $list_array[] = array(
                'details' => $produt->where('id',$cl['product_id'])->first(),
                'cart_detail' => $cl
            );
---
SELECT *
FROM `cart`
WHERE `user_id` = '3'
SELECT *
FROM `pet_products`
WHERE `id` = '7'
 LIMIT 1

    public function deletecart($id){
        $cart = new CartModel();
        if($cart->delete($id)){
            return redirect()->back()->with('success', 'Successfully Deleted from cart.');
---
SELECT *
FROM `cart`
WHERE `user_id` = '3'