app/Models/UserModel.php

    public function add($data){
        return $this->insert($data);
---
INSERT INTO `user` (`name`, `email`, `phone`, `password`, `type`, `status`, `created_at`, `updated_at`) VALUES ('Manish Kumar Dev', 'devmanish1743@gmail.com', '9813347990', '$2y$10$W0uAxtPagHbLqnXwVbR44OJP5LYsLiC084T3I.1MWNqRc/pcDE8cq', 1, 1, '2024-01-03 17:14:08', '2024-01-03 17:14:08')

    public function findByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'devmanish1743@gmail.com'
 LIMIT 1